{
    "Syllabus": [
        {
            "BCA": [
                {
                    "Semester_1": [
                        {
                            "Subject": [
                                {
                                    "SubjectName": "Problem Solving And Programming in C",
                                    "code ": "CA101",
                                    "openCode": "BCA11",
                                    "shortName": "PSPC",
                                    "credit": 3,
                                    "listOrder": 1,
                                    "content": [
                                        {
                                            "module": "Module - I",
                                            "content": "Problem Solving and Programming Concepts: Problem Solving in Everyday Life, Types of Problem, Problem Solving with Computers.\n Overview of C: History of C, Importance of C, Structure of C program, Sample of C programs. Constant, Variable and Data types: C Tokens - keywords, identifier, constant, string, and operators, and symbols, Data types - primary data types, user defined data types, and derived data types, Declaration of variables, assign values to variables.\nOperators and Expressions: Different types of operators - arithmetic operators, relational operators, logical operators, assignment operators, increment and decrement operators, bitwise operators, conditional operators and special operators, Arithmetic expressions - precedence of arithmetic operators, Type conversions in expressions.\nManaging input and output operations: Reading a character, Writing a character, Formatted input, Formatted output."
                                        },
                                        {
                                            "module": "Module - II",
                                            "content": "Decision making and Branching: Decision making with if statement - Simple if statement, The if …. Else statement, Nesting of if …. Else statement, The else if ladder, The switch statement, The ? : Operator, The go-to statement.\nDecision making and Looping: The while statement, The do statement, The for statement, Jumps in loops."
                                        },
                                        {
                                            "module": "Module - III",
                                            "content": "Arrays: One - dimensional arrays, Declaration of one - dimensional arrays, Twodimensional arrays, Declaration of two - dimensional arrays, Multi - dimensional arrays.\nCharacter Arrays and String: Declaring and initializing string variables, Reading string from terminal, Writing string to screen, Putting string together, Comparison of two strings, String handling functions, Other features of strings."
                                        },
                                        {
                                            "module": "Module - IV",
                                            "content": "User defined functions: A multi - function program, Definition of function, Function calls, Function declaration, Category of functions, Nesting of functions, Recursion, Passing arrays to functions, Passing strings to functions."
                                        },
                                        {
                                            "module": "Module - V",
                                            "content": "Structures and Unions: Defining a structure, Declaring structure variables, Accessing structure members, Arrays of structures, Arrays within structures, Structures within structures, Structures and functions, Union.\nPointers: Understanding pointers, Accessing the address of a variable, Declaring pointer variables, Pointer expressions, Array of pointers, Pointers to function, Pointers and structures.\nFile Management: Defining and opening a file, Closing a file, Input/ Output operations on files, Error handling during I/O operations "
                                        }
                                    ],
                                    "book": [
                                        {
                                            "textBooks": [
                                                {
                                                    "bookName": "Balagurusamy E., “Programming in ANSI C”, 5thEdition, TMH, 2010. (T1)"
                                                },
                                                {
                                                    "bookName": "Sprankle M., “Problem Solving and Programming Concepts”, 7thEdition, Pearson Education, NewDelhi, 2006.(T2)"
                                                }
                                            ],
                                            "referenceBook": [
                                                {
                                                    "bookName": "Gottfried B. S., “Programming with C”, Schaum Series, McGraw Hill, 2005. (R1)"
                                                },
                                                {
                                                    "bookName": "Kanetkar Y., “Let us C”, 4th Edition, BPB publication, New Delhi, 2002.(R2)"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ],
            "BBA": [
                {}
            ]
        }
    ]
}